In [1]:
#import useful libraries
import pandas as pd
import numpy as np

In [18]:
df = pd.read_csv('bank_transactions.csv', delimiter=',')

In [3]:
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10/1/94,F,JAMSHEDPUR,17819.05,2/8/16,143207,25.0
1,T2,C2142763,4/4/57,M,JHAJJAR,2270.69,2/8/16,141858,27999.0
2,T3,C4417068,26/11/96,F,MUMBAI,17874.44,2/8/16,142712,459.0
3,T4,C5342380,14/9/73,F,MUMBAI,866503.21,2/8/16,142714,2060.0
4,T5,C9031234,24/3/88,F,NAVI MUMBAI,6714.43,2/8/16,181156,1762.5

# Finding Similar Customers

## 1.1 Set up the date

In [19]:
reduced_df = df.drop(['TransactionID', 'TransactionDate'], axis=1)
reduced_df

,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionTime,TransactionAmount (INR)
0,C5841053,10/1/94,F,JAMSHEDPUR,17819.05,143207,25.0
1,C2142763,4/4/57,M,JHAJJAR,2270.69,141858,27999.0
2,C4417068,26/11/96,F,MUMBAI,17874.44,142712,459.0
3,C5342380,14/9/73,F,MUMBAI,866503.21,142714,2060.0
4,C9031234,24/3/88,F,NAVI MUMBAI,6714.43,181156,1762.5
...,...,...,...,...,...,...,...
1048562,C8020229,8/4/90,M,NEW DELHI,7635.19,184824,799.0
1048563,C6459278,20/2/92,M,NASHIK,27311.42,183734,460.0
1048564,C6412354,18/5/89,M,HYDERABAD,221757.06,183313,770.0
1048565,C6420483,30/8/78,M,VISAKHAPATNAM,10117.87,184706,1000.0
1048566,C8337524,5/3/84,M,PUNE,75734.42,181222,1166.0

In [7]:
def hash(val, a, b, c):
    return (a*val+b)%c

In [20]:
reduced_df['CustGender'] = reduced_df['CustGender'].apply(lambda x: 1 if x == 'F' else 0)
reduced_df['CustAccountBalance'] = reduced_df['CustAccountBalance'].to_numpy(dtype = np.uint32)
reduced_df['TransactionAmount (INR)'] = reduced_df['TransactionAmount (INR)'].to_numpy(dtype = np.uint32)
reduced_df['CustomerDOB'] = pd.to_datetime(reduced_df['CustomerDOB'])

In [26]:
reduced_df['CustomerDOB'] = reduced_df['CustomerDOB'].apply(lambda x: str(x).split('-')[0])

In [30]:
reduced_df['CustLocation'] = reduced_df['CustLocation'].apply(lambda x: sum(ord(c)) for c in )

NameError: name 'x' is not defined

In [24]:
reduced_df

,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionTime,TransactionAmount (INR)
0,C5841053,1994,1,JAMSHEDPUR,17819,143207,25
1,C2142763,2057,0,JHAJJAR,2270,141858,27999
2,C4417068,1996,1,MUMBAI,17874,142712,459
3,C5342380,1973,1,MUMBAI,866503,142714,2060
4,C9031234,1988,1,NAVI MUMBAI,6714,181156,1762
...,...,...,...,...,...,...,...
1048562,C8020229,1990,0,NEW DELHI,7635,184824,799
1048563,C6459278,1992,0,NASHIK,27311,183734,460
1048564,C6412354,1989,0,HYDERABAD,221757,183313,770
1048565,C6420483,1978,0,VISAKHAPATNAM,10117,184706,1000
1048566,C8337524,1984,0,PUNE,75734,181222,1166

## 1.2 Fingerprint Hashing

## 1.3 Locality Sensitive Hashing (LSH)